[Killed] BlockStatement
verification-validation-testing/Lab4/src/advanced.js:2:20
 
-function pow(x, n) {
-    if (x == 0 && n == 0) {
-        return null;
-    }
-    else{
-    return Math.pow(x, n);
-    }
-}
+function pow(x, n) {}
 
 function modulo(a, b) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
verification-validation-testing/Lab4/src/advanced.js:3:19
 
 function pow(x, n) {
-    if (x == 0 && n == 0) {
+    if (x == 0 && true) {
         return null;
     }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: null

[Killed] EqualityOperator
verification-validation-testing/Lab4/src/advanced.js:3:19
 
 function pow(x, n) {
-    if (x == 0 && n == 0) {
+    if (x == 0 && n != 0) {
         return null;
     }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: null

[Killed] BlockStatement
verification-validation-testing/Lab4/src/advanced.js:6:9
     if (x == 0 && n == 0) {
         return null;
     }
-    else{
-    return Math.pow(x, n);
-    }
+    else{}
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
