[Killed] BlockStatement
verification-validation-testing/Lab4/src/basic.js:13:23
   return a * b;
 }
 
-function divide(a, b) {
-  // if (b === 0) {
-  //   return 0;
-  // }
-  // else {
-  return a / b;
-}
+function divide(a, b) {}
 
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: undefined

[Killed] ArithmeticOperator
verification-validation-testing/Lab4/src/basic.js:18:10
   //   return 0;
   // }
   // else {
-  return a / b;
+  return a * b;
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.5
Received: 2
