[Timeout] BlockStatement
verification-validation-testing/LabFinal/src/1-BMI.js:2:1
 function calculateBMI(heightInCM, weightInKG)
-{
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
-        return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
-        return"Please provide a valid weight";
-    } else {
-        return (weightInKG / ((heightInCM*heightInCM)/10000)).toFixed(2);
-    }
-}
+{}
 // console.log(calculateBMI(180,60));
 

[Timeout] LogicalOperator
verification-validation-testing/LabFinal/src/1-BMI.js:3:8
 function calculateBMI(heightInCM, weightInKG)
 {
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
+    if(heightInCM === '' && heightInCM < 0 || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){

[Timeout] ConditionalExpression
verification-validation-testing/LabFinal/src/1-BMI.js:3:9
 function calculateBMI(heightInCM, weightInKG)
 {
-    if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
+    if((false) || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){

[Timeout] StringLiteral
verification-validation-testing/LabFinal/src/1-BMI.js:4:16
 function calculateBMI(heightInCM, weightInKG)
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
-        return "Please provide a valid height"; 
+        return ""; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";

[Timeout] EqualityOperator
verification-validation-testing/LabFinal/src/1-BMI.js:5:37
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
+    } else if (weightInKG === '' || weightInKG <= 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {

[Timeout] ConditionalExpression
verification-validation-testing/LabFinal/src/1-BMI.js:5:16
 {
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
-    } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
+    } else if (true){
         return"Please provide a valid weight";
     } else {

[Timeout] StringLiteral
verification-validation-testing/LabFinal/src/1-BMI.js:6:15
     if((heightInCM === '') || (heightInCM < 0) || (isNaN(heightInCM))){
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
-        return"Please provide a valid weight";
+        return"";
     } else {
         return (weightInKG / ((heightInCM*heightInCM)/10000)).toFixed(2);

[Timeout] BlockStatement
verification-validation-testing/LabFinal/src/1-BMI.js:7:12
         return "Please provide a valid height"; 
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
-    } else {
-        return (weightInKG / ((heightInCM*heightInCM)/10000)).toFixed(2);
-    }
+    } else {}
 }
 // console.log(calculateBMI(180,60));

[Timeout] ArithmeticOperator
verification-validation-testing/LabFinal/src/1-BMI.js:8:31
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {
-        return (weightInKG / ((heightInCM*heightInCM)/10000)).toFixed(2);
+        return (weightInKG / (heightInCM * heightInCM * 10000)).toFixed(2);
     }
 }

[Timeout] ArithmeticOperator
verification-validation-testing/LabFinal/src/1-BMI.js:8:32
     } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)){
         return"Please provide a valid weight";
     } else {
-        return (weightInKG / ((heightInCM*heightInCM)/10000)).toFixed(2);
+        return (weightInKG / ((heightInCM / heightInCM)/10000)).toFixed(2);
     }
 }
