[Timeout] BlockStatement
verification-validation-testing/LabFinal/src/2-converter.js:2:1
 function temperatureConverter(measurement, val)
-{
-    var result1, result2;
-
-    if(measurement == "F")
-    {
-        result1 = ((val-32)/1.8).toFixed(2) + " C";
-        result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
-    } else if(measurement === "C") {
-        result1 = ((val*1.8)+32).toFixed(2) + " F";
-        result2 = (val+273.15).toFixed(2) + " K"; 
-    } else if(measurement === "K") {
-        result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
-        result2 = (val-273.15).toFixed(2) + " C";
-    } else {
-        return "wrong input";
-    }
-    return [result1, result2];
-}
+{}
 console.log(temperatureConverter("F", 32));
 module.exports = {

[Timeout] ConditionalExpression
verification-validation-testing/LabFinal/src/2-converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "F")
+    if(true)
     {
         result1 = ((val-32)/1.8).toFixed(2) + " C";

[Timeout] EqualityOperator
verification-validation-testing/LabFinal/src/2-converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "F")
+    if(measurement != "F")
     {
         result1 = ((val-32)/1.8).toFixed(2) + " C";

[Timeout] BlockStatement
verification-validation-testing/LabFinal/src/2-converter.js:6:5
     var result1, result2;
 
     if(measurement == "F")
-    {
-        result1 = ((val-32)/1.8).toFixed(2) + " C";
-        result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
-    } else if(measurement === "C") {
+    {} else if(measurement === "C") {
         result1 = ((val*1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 

[Timeout] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:7:20
 
     if(measurement == "F")
     {
-        result1 = ((val-32)/1.8).toFixed(2) + " C";
+        result1 = ((val - 32) * 1.8).toFixed(2) + " C";
         result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
     } else if(measurement === "C") {

[Timeout] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:7:21
 
     if(measurement == "F")
     {
-        result1 = ((val-32)/1.8).toFixed(2) + " C";
+        result1 = ((val + 32)/1.8).toFixed(2) + " C";
         result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
     } else if(measurement === "C") {

[Killed] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:8:22
     if(measurement == "F")
     {
         result1 = ((val-32)/1.8).toFixed(2) + " C";
-        result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
+        result2 = (((val + 32)/1.8)+273.15).toFixed(2) + " K";
     } else if(measurement === "C") {
         result1 = ((val*1.8)+32).toFixed(2) + " F";
killedBy: All tests
statusReason: > test
> jest


FAIL test/2-converter.test.js

  ● Console

[Timeout] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:8:21
     if(measurement == "F")
     {
         result1 = ((val-32)/1.8).toFixed(2) + " C";
-        result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
+        result2 = (((val - 32) * 1.8)+273.15).toFixed(2) + " K";
     } else if(measurement === "C") {
         result1 = ((val*1.8)+32).toFixed(2) + " F";

[Killed] EqualityOperator
verification-validation-testing/LabFinal/src/2-converter.js:9:15
     {
         result1 = ((val-32)/1.8).toFixed(2) + " C";
         result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
-    } else if(measurement === "C") {
+    } else if(measurement !== "C") {
         result1 = ((val*1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
killedBy: All tests
statusReason: > test
> jest


PASS test/1-BMI.test.js

PASS test/3-sorting.test.js

[Killed] ConditionalExpression
verification-validation-testing/LabFinal/src/2-converter.js:9:15
     {
         result1 = ((val-32)/1.8).toFixed(2) + " C";
         result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
-    } else if(measurement === "C") {
+    } else if(false) {
         result1 = ((val*1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
killedBy: All tests
statusReason: > test
> jest


PASS test/3-sorting.test.js

FAIL test/2-converter.test.js

[Killed] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:10:20
         result1 = ((val-32)/1.8).toFixed(2) + " C";
         result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
     } else if(measurement === "C") {
-        result1 = ((val*1.8)+32).toFixed(2) + " F";
+        result1 = (val * 1.8 - 32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
     } else if(measurement === "K") {
killedBy: All tests
statusReason: > test
> jest


PASS test/1-BMI.test.js

PASS test/3-sorting.test.js

[Killed] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:10:21
         result1 = ((val-32)/1.8).toFixed(2) + " C";
         result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
     } else if(measurement === "C") {
-        result1 = ((val*1.8)+32).toFixed(2) + " F";
+        result1 = ((val / 1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
     } else if(measurement === "K") {
killedBy: All tests
statusReason: > test
> jest


PASS test/3-sorting.test.js

PASS test/1-BMI.test.js

[Killed] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:11:20
         result2 = (((val-32)/1.8)+273.15).toFixed(2) + " K";
     } else if(measurement === "C") {
         result1 = ((val*1.8)+32).toFixed(2) + " F";
-        result2 = (val+273.15).toFixed(2) + " K"; 
+        result2 = (val - 273.15).toFixed(2) + " K"; 
     } else if(measurement === "K") {
         result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
killedBy: All tests
statusReason: > test
> jest


FAIL test/2-converter.test.js

  ● Console

[Killed] BlockStatement
verification-validation-testing/LabFinal/src/2-converter.js:12:36
     } else if(measurement === "C") {
         result1 = ((val*1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
-    } else if(measurement === "K") {
-        result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
-        result2 = (val-273.15).toFixed(2) + " C";
-    } else {
+    } else if(measurement === "K") {} else {
         return "wrong input";
     }
killedBy: All tests
statusReason: > test
> jest


PASS test/1-BMI.test.js

PASS test/3-sorting.test.js

[Killed] ConditionalExpression
verification-validation-testing/LabFinal/src/2-converter.js:12:15
     } else if(measurement === "C") {
         result1 = ((val*1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
-    } else if(measurement === "K") {
+    } else if(true) {
         result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
         result2 = (val-273.15).toFixed(2) + " C";
killedBy: All tests
statusReason: > test
> jest


PASS test/3-sorting.test.js

PASS test/1-BMI.test.js

[Killed] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:13:20
         result1 = ((val*1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
     } else if(measurement === "K") {
-        result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
+        result1 = ((val - 273.15) * 1.8 - 32).toFixed(2) + " F";
         result2 = (val-273.15).toFixed(2) + " C";
     } else {
killedBy: All tests
statusReason: > test
> jest


FAIL test/2-converter.test.js

  ● Console

[Killed] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:13:22
         result1 = ((val*1.8)+32).toFixed(2) + " F";
         result2 = (val+273.15).toFixed(2) + " K"; 
     } else if(measurement === "K") {
-        result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
+        result1 = (((val + 273.15)*1.8)+32).toFixed(2) + " F";
         result2 = (val-273.15).toFixed(2) + " C";
     } else {
killedBy: All tests
statusReason: > test
> jest


PASS test/1-BMI.test.js

FAIL test/2-converter.test.js

[Timeout] ArithmeticOperator
verification-validation-testing/LabFinal/src/2-converter.js:14:20
         result2 = (val+273.15).toFixed(2) + " K"; 
     } else if(measurement === "K") {
         result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
-        result2 = (val-273.15).toFixed(2) + " C";
+        result2 = (val + 273.15).toFixed(2) + " C";
     } else {
         return "wrong input";

[Timeout] BlockStatement
verification-validation-testing/LabFinal/src/2-converter.js:15:12
     } else if(measurement === "K") {
         result1 = (((val-273.15)*1.8)+32).toFixed(2) + " F";
         result2 = (val-273.15).toFixed(2) + " C";
-    } else {
-        return "wrong input";
-    }
+    } else {}
     return [result1, result2];
 }

[Timeout] StringLiteral
verification-validation-testing/LabFinal/src/2-converter.js:20:34
     }
     return [result1, result2];
 }
-console.log(temperatureConverter("F", 32));
+console.log(temperatureConverter("", 32));
 module.exports = {
     temperatureConverter
