[Timeout] BlockStatement
verification-validation-testing/LabFinal/src/3-sorting.js:1:29
-function selectionSort(arr) { 
-    let n = arr.length;
-        
-    for(let i = 0; i < n; i++) {
-        let min = i;
-        for(let j = i+1; j < n; j++){
-            if(arr[j] < arr[min]) {
-                min=j; 
-            }
-         }
-         if (min != i) {
-             let tmp = arr[i]; 
-             arr[i] = arr[min];
-             arr[min] = tmp;      
-        }
-    }
-    return arr;
-}
+function selectionSort(arr) {}
 //console.log(selectionSort([2,1,4,3]))
 module.exports = {

[Timeout] UpdateOperator
verification-validation-testing/LabFinal/src/3-sorting.js:4:27
 function selectionSort(arr) { 
     let n = arr.length;
         
-    for(let i = 0; i < n; i++) {
+    for(let i = 0; i < n; i--) {
         let min = i;
         for(let j = i+1; j < n; j++){

[Timeout] BlockStatement
verification-validation-testing/LabFinal/src/3-sorting.js:6:37
         
     for(let i = 0; i < n; i++) {
         let min = i;
-        for(let j = i+1; j < n; j++){
-            if(arr[j] < arr[min]) {
-                min=j; 
-            }
-         }
+        for(let j = i+1; j < n; j++){}
          if (min != i) {
              let tmp = arr[i]; 

[Timeout] EqualityOperator
verification-validation-testing/LabFinal/src/3-sorting.js:6:26
         
     for(let i = 0; i < n; i++) {
         let min = i;
-        for(let j = i+1; j < n; j++){
+        for(let j = i+1; j >= n; j++){
             if(arr[j] < arr[min]) {
                 min=j; 

[Killed] BlockStatement
verification-validation-testing/LabFinal/src/3-sorting.js:11:24
                 min=j; 
             }
          }
-         if (min != i) {
-             let tmp = arr[i]; 
-             arr[i] = arr[min];
-             arr[min] = tmp;      
-        }
+         if (min != i) {}
     }
     return arr;
killedBy: All tests
statusReason: > test
> jest


PASS test/2-converter.test.js

  ● Console

[Timeout] EqualityOperator
verification-validation-testing/LabFinal/src/3-sorting.js:11:14
                 min=j; 
             }
          }
-         if (min != i) {
+         if (min == i) {
              let tmp = arr[i]; 
              arr[i] = arr[min];
